def trslt(string: str) ->str:
	"""
	Транслитерация русских букв, замена спецсимволов и пробелов(по маркван-правила).
	Используется для генерации имен файлов, папок и автоматических идентификаторов заголовков.
	"""
	letter_ok = ('#', '\\', '/', '~', '-', '_', '.', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j',
			  'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
			  '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',)
	letter_match = {' ': '_', "'": '', 'ь':'', 'ъ':'', 'а':'a', 'б':'b','в':'v',
	   'г':'g', 'д':'d', 'е':'e', 'ё':'yo','ж':'zh',
	   'з':'z', 'и':'i', 'й':'y', 'к':'k', 'л':'l',
	   'м':'m', 'н':'n', 'о':'o', 'п':'p', 'р':'r', 
	   'с':'s', 'т':'t', 'у':'u', 'ф':'f', 'х':'h',
	   'ц':'ts', 'ч':'ch', 'ш':'sh', 'щ':'sch', 'ы':'yi',
	   'э':'e', 'ю':'yu', 'я':'ya'}
	trslt_string = ''
	string = string.lower().rstrip()
	for s in string:
		if s in letter_ok:
			trslt_string += s
		elif s in letter_match:
			trslt_string += letter_match[s]
		else:
			continue
	return trslt_string
